export const columnNames = [
  'id',
  'Дата',
  "Прізвище та ім'я",
  'Email',
  'Контактний телефон',
  'Telegram',
  'Місто',
  'Рівень англійської',
  'Посилання на резюме',
  'Посилання на linkedin',
  'Що мотивує взяти участь у стажуванні',
  'Які проекти/задачі/технології/інструменти Вас цікавлять та хотіли б вивчити протягом стажування?',
  'Чи є у Вас проекти, над якими Ви працювали раніше, та як Ви досягали успіху у їх виконанні?',
  'Бажана заробітна плата після стажування?',
  'Всього питань до тесту',
  'Кількість вірних відповідей',
  'Чи пройшов(ла) тест',
  'Лінка на живу сторінку проекту',
  'Лінка на репозиторій з кодом проекту',
  'Оціни важкість тестового завдання',
  'Які труднощі виникли при виконанні ТЗ?',
  'Фідбек по тестовому завданню для відправки кандидату',
  'Оцінка ТЗ по 10-бальній шкалі',
  'Дата співбесіди',
  'Звіт по співбесіді. Загальні враження та про що домовились',
  'Статус по кандидату',
  'Статус по фідбеку',
  'Перевіряючий',
];

export const userCellData = {
  id: 'id',
  Дата: 'createAt',
  "Прізвище та ім'я": ['lastName', 'firstName'],
  Email: 'email',
  'Контактний телефон': 'phone',
  Telegram: 'telegramContact',
  Місто: 'currentCity',
  'Рівень англійської': 'englishLevel',
  'Посилання на резюме': 'resumeUrl',
  'Посилання на linkedin': 'linkedinUrl',
  'Що мотивує взяти участь у стажуванні': 'whyAreYou',
  'Які проекти/задачі/технології/інструменти Вас цікавлять та хотіли б вивчити протягом стажування?':
    'whatProjectsInterested',
  'Чи є у Вас проекти, над якими Ви працювали раніше, та як Ви досягали успіху у їх виконанні?':
    'haveProjects',
  'Бажана заробітна плата після стажування?': 'desiredSalary',
};

export const technicalTestCellData = {
  'Лінка на живу сторінку проекту': 'livePageLink',
  'Лінка на репозиторій з кодом проекту': 'repositoryLink',
  'Оціни важкість тестового завдання': 'difficulty',
  'Які труднощі виникли при виконанні ТЗ?': 'comments',
};

export const testingCellData = {
  'Всього питань до тесту': 'numberOfQuestions',
  'Кількість вірних відповідей': 'correctAnswers',
  'Чи пройшов(ла) тест': 'isPassTest',
};
